app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name'     => ['required', 'string', 'max:255'],
            'email'    => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name'     => $request->name,
            'email'    => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Danilo', 'dandevweb@gmail.com', '$2y$10$8ZKSu327Y/LsRLKqHlxpe.PKjfabNO1WstxSYsEqst1wikcacTKh2', '2023-09-13 22:27:59', '2023-09-13 22:27:59')